{
    "NavBar":{
        "Home": "Home",
        "Profile": "Profile",
        "Experiencie": "Working Experience",
        "Proyects": "Personal Projects",
        "Learn": "Learn programming",
        "Games": "Games"
    },
    "Home":{
        "Greetings": "HELLO!!",
        "Name": "I'm Miguel Ibáñez González",
        "Job": "Computer science engineer",
        "Welcome": "Welcome to my portfolio",
        "Explore": "Get to know me, play a little and learn with me",
        "Software": "Computer Engineer - Software Architect"
    },
    "Profile":{
        "Info": "Information",
        "Profile":"Profile",
        "Skills": "Skills",
        "Name": "Name",
        "MyName": "Miguel Ibáñez González",
        "Career": "Career",
        "MyCareer": "Computer Engineer",
        "Master": "Postgraduate",
        "MyMaster": "Computer Engineer",
        "Residence" : "Residence",
        "MyResidence": "Madrid - Spain",
        "University": "Universisty",
        "MyUniversity": "Autonomous University of Madrid",
        "Gmail": "Gmail",
        "MyGmail": "miguel.ibanez.gon@gmail.com",
        "Linkedin": "Linkedin",
        "MyLinkedin": "in/miguel-ibañez",
        "GitHub": "GitHub",
        "MyGitHub": "github.com/MiguelIbanezG",
        "Phone": "Phone",
        "MyPhone": "+34 676134878",
        "About_me": "About me",
        "Info_about_me": "Computer Engineer specialized in software development and IT solutions. Passionate about technology, with strong skills in programming, data analysis, and software architecture. I am currently working at Vaelsys, where I am mainly responsible for the development and improvement of Vaelsys V4, an advanced real-time video analysis system. In addition, I work on the development and optimization of various web applications, both backend and frontend, as well as their deployment and maintenance. I also manage clustering to ensure the scalability and efficiency of different systems.",
        "Languages": "Programming Languages",
        "Databases": "Databases",
        "Markup": "Markup Languages and Style Sheets",
        "Technologies": "Tools and Technologies",
        "Frameworks": "Frameworks",
        "Resume": "Resume",
        "MyResume":" Download My Resume",
        "Worked":"I Have Worked With:"
    },
    "Exeperiencie":{
        "Jobs":"Where I have Worked:",
        "Exeperiencie":"My Experience",
        "Design": "I worked as a Frontend developer in the creation of the corporate website of the signage company Filigree Design. The project was developed without frameworks, using HTML, CSS, and pure JavaScript, which allowed me to strengthen my knowledge of structured programming and code optimization for more efficient performance. In addition to the technical implementation, I was also in charge of the visual design of the page, taking care of the brand identity and user experience through a clear, modern interface adaptable to different devices. This work allowed me to put into practice both my Frontend development skills and my graphic design and web usability capabilities, achieving a result that met the company's requirements. Period: January 2023 - June 2023.",
        "Vaelsys": "I currently work at Vaelsys full-time as a Software Developer, participating in the development and optimization of web applications in all their layers, both backend and frontend. My responsibilities include everything from implementing new features to optimizing the performance and security of existing systems. In addition, I am involved in the deployment and maintenance of production environments, ensuring their availability and stability. A fundamental part of my work is the management and configuration of clusters, which ensures the scalability, resilience, and efficiency of applications, as well as their correct integration into distributed and high-demand architectures. This role has allowed me to strengthen my knowledge in software development, systems administration, and DevOps, working with modern technologies and agile methodologies to deliver robust solutions tailored to the needs of each project. Period: October 2023 - Present.",
        "V4": "I am mainly responsible for the development and continuous improvement of Vaelsys V4, an advanced real-time video analysis system designed for high-demand environments. My work ranges from implementing new features to optimizing performance and scalability, ensuring the system can efficiently process large volumes of data. This role has deepened my expertise in video processing technologies, distributed systems, and cluster deployment. I contribute to the development of an innovative solution capable of delivering real-time analysis with high levels of reliability."
    }
}
