{
    "NavBar":{
        "Home": "Home",
        "Profile": "Perfil",
        "Experiencie": "Experiencia Laboral",
        "Proyects": "Proyectos Personales",
        "Learn": "Aprende Programación",
        "Games": "Juegos"
    },
    "Home":{
        "Greetings": "HOLAA!!",
        "Name": "Soy Miguel Ibáñez González",
        "Job": "Ingeniero Técnico Informático",
        "Welcome": "Bienvenido a mi portfolio",
        "Explore": "Conoceme, juega un poco y aprende conmigo",
        "Software": "Ingeniero Informático - Arquitecto de software"
    },
    "Profile":{
        "Info":"Información",
        "Profile":"Perfil",
        "Skills": "Habilidades",
        "Name": "Nombre",
        "MyName": "Miguel Ibáñez González",
        "Career": "Carrera",
        "MyCareer": "Ingeniería Informática",
        "Master": "Master",
        "MyMaster": "Ingeniería Informática",
        "Residence" : "Residencia",
        "MyResidence": "Madrid - España",
        "University": "Universidad",
        "MyUniversity": "Universidad Autónoma de Madrid",
        "Gmail": "Gmail",
        "MyGmail": "miguel.ibanez.gon@gmail.com",
        "Linkedin": "Linkedin",
        "MyLinkedin": "in/miguel-ibañez",
        "GitHub": "GitHub",
        "MyGitHub": "github.com/MiguelIbanezG",
        "Phone": "Teléfono",
        "MyPhone": "+34 676134878",
        "About_me": "Sobre mi",
        "Info_about_me": "Ingeniero Informático especializado en el desarrollo de software y en la búsqueda de soluciones tecnológicas innovadoras. Me apasiona la tecnología y disfruto enfrentar nuevos retos que me permitan crecer tanto personal como profesionalmente. Cuento con sólidas habilidades en programación, análisis de datos y arquitectura de software, lo que me permite abordar proyectos de principio a fin con una visión integral. Tengo experiencia diseñando e implementando aplicaciones eficientes, escalables y orientadas al usuario, siempre con un enfoque en la calidad y la optimización del rendimiento. Mi objetivo es aportar valor a través de la creación de soluciones creativas y efectivas, combinando conocimiento técnico con una mentalidad analítica y resolutiva.",
        "Languages":"Lenguajes de Programación",
        "Databases": "Bases de datos",
        "Markup": "Lenguajes de Marcado y Hojas de Estilo",
        "Technologies":"Herramientas y Tecnologías",
        "Frameworks": "Frameworks",
        "Resume": "Curriculum",
        "MyResume":" Descargar Curriculum",
        "Worked":"He trabajado con:"
    },
    "Exeperiencie":{
        "Jobs":"Donde he trabajado",
        "Exeperiencie":"My Experience",
        "Design": "Trabajé como desarrollador Frontend en la creación de la página web corporativa de la empresa de rótulos Filigree Design. El proyecto fue desarrollado sin frameworks, utilizando HTML, CSS y JavaScript puros, lo que me permitió afianzar mis conocimientos en programación estructurada y en la optimización de código para un rendimiento más eficiente. Además de la implementación técnica, también estuve a cargo del diseño visual de la página, cuidando la identidad de marca y la experiencia de usuario mediante una interfaz clara, moderna y adaptable a distintos dispositivos. Este trabajo me permitió poner en práctica tanto mis habilidades de desarrollo Frontend como mis capacidades en diseño gráfico y usabilidad web, logrando un resultado que cumplió con los requerimientos de la empresa. Periodo: enero 2023 – junio 2023.",
        "Vaelsys": "Actualmente trabajo en Vaelsys a jornada completa como Desarrollador de Software, participando en el desarrollo y optimización de aplicaciones web en todas sus capas, tanto backend como frontend. Mis responsabilidades incluyen desde la implementación de nuevas funcionalidades hasta la optimización del rendimiento y la seguridad de los sistemas existentes. Además, estoy involucrado en el despliegue y mantenimiento de entornos productivos, garantizando su disponibilidad y estabilidad. Parte fundamental de mi labor es la gestión y configuración de clústeres, lo que permite asegurar la escalabilidad, resiliencia y eficiencia de las aplicaciones, así como su correcta integración en arquitecturas distribuidas y de alta demanda. Este rol me ha permitido afianzar mis conocimientos en desarrollo de software, administración de sistemas y DevOps, trabajando con tecnologías modernas y metodologías ágiles para entregar soluciones robustas y adaptadas a las necesidades de cada proyecto. Periodo : octubre 2023 - actualidad.",
        "V4": "Me encargo principalmente del desarrollo y la mejora continua de Vaelsys V4, un avanzado sistema de análisis de vídeo en tiempo real diseñado para entornos de alta exigencia. Mi trabajo abarca desde la implementación de nuevas funcionalidades hasta la optimización del rendimiento y la escalabilidad del sistema, garantizando que pueda procesar grandes volúmenes de datos de manera eficiente y precisa. Dentro de este rol, participo en la integración de módulos de inteligencia artificial y visión por computador, así como en la mejora de la arquitectura de software para asegurar la robustez, la flexibilidad y la adaptabilidad de la plataforma a distintos escenarios de seguridad y monitorización. Este proyecto me ha permitido profundizar en tecnologías de procesamiento de vídeo, sistemas distribuidos y despliegue en clústeres, contribuyendo al desarrollo de una solución innovadora capaz de ofrecer análisis en tiempo real con altos niveles de fiabilidad."
    }
}
